cfm_webservice_la/src/test/resources/la_recv_response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <b:DRNADDO_REC xmlns:a="http://www.csc.smart/bo/schemas/DRNADDI" xmlns:b="http://www.csc.smart/bo/schemas/DRNADDO" xmlns:c="http://www.csc.smart/bo/schemas/DRNDELI" xmlns:d="http://www.csc.smart/bo/schemas/DRNDELO" xmlns:e="http://www.csc.smart/msp/schemas/MSPContext" xmlns:f="http://www.csc.smart/bo/schemas/Error">
         <STATUS>0</STATUS>
         <MORE_IND>N</MORE_IND>
         <ADDITIONAL_FIELDS>
            <DRNOUTRECS>
               <STATUS>SC</STATUS>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
              <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
              <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
              <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
              <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
              <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
              <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
           </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
              <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
              <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
              <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
            <DRNOUTRECS>
               <STATUS/>
               <RECEIPT/>
               <FLDNAM/>
               <ERRCODE/>
               <ERRMESS/>
            </DRNOUTRECS>
         </ADDITIONAL_FIELDS>
      </b:DRNADDO_REC>
   </soapenv:Body>
</soapenv:Envelope>